package com.yarolegovich.dalilegamalek.sample.Activity;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;

import android.support.v7.widget.AppCompatButton;
import android.support.v7.widget.Toolbar;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.EditText;
import android.widget.Spinner;
import android.widget.Toast;

import com.yarolegovich.dalilegamalek.sample.R;

import me.anwarshahriar.calligrapher.Calligrapher;

public class FilterActivity extends AppCompatActivity {
String [] egypt={"القاهرة", "الجيزة","المنبا","السويس","الأقصر","الاسكندرية","بورسعيد","دمياط","أسوان","القليوبية","بنى سويف","الاسماعيلية","" +
            "سوهاج","أسيوط","البحر الأحمر","البحيرة","الدقهلية","الغربية","الفيوم","قنا","كفر الشيخ","مطروح","المنوفيه","الوادى الجديد","" +
            "6 من أكنوبر","شمال سيناء","جنوب سيناء","حلوان","الشارقية"};
String [] saudia={"الرياض","مكة المكرمة","المدينة المنورة","القصيم","الشرقية","عسير","تبوك","حائل","الحدود الشمالية","جازان","نجران","" +
        "الباحة","الجوف"};
String [] emarat={"دبي","أبوظبي","الشارقة","العين","رأس الخيمة","عجمان","الفجيرة","أم القيوين","خورفكان","دبا الحصن"};
String [] bahren={"العاصمة","المحرق","الشمالية","الجنوبية"};
String [] aman={"الداخلية","الظاهرة","شمال الباطنة","جنوب الباطنة","البريمى","الوسطى","شمال الشرقية","جنوب الشرقية","ظفار","مسقط","مسندم"};
String []qatar={"الريان","الدوحة","الخور","الوكرة","الشمال","أم صلال"};
String []kuwait={"العاصمة","الجهراء","الفراونية","حولى","مبارك الكبير"};
Spinner spn,spncontry;
    AppCompatButton search;
    Intent intent;
    int id;
    EditText fromm,too;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_filter);
        intent=getIntent();
        id=intent.getIntExtra("id",0);
        Calligrapher calligrapher = new Calligrapher(this);
        calligrapher.setFont(this, "Droid.ttf", true);
        Toolbar toolbar = (Toolbar) findViewById(R.id.app_bar);
        setSupportActionBar(toolbar);
        toolbar.setNavigationIcon(R.drawable.ic_chevron_right_black_24dp);
        setSupportActionBar(toolbar);
        toolbar.setNavigationOnClickListener(
                new View.OnClickListener() {
                    @Override
                    public void onClick(View v) {
                        finish();
                    }
                }
        );
        search=findViewById(R.id.btn_login);
        fromm=findViewById(R.id.from);
        too=findViewById(R.id.to);
        search.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(fromm.getText().toString()==null||fromm.getText().toString().equals("")||too.getText().toString()==null||too.getText().toString().equals("")){
                    String city=spn.getSelectedItem().toString();
                    Toast.makeText(FilterActivity.this, "dasdad", Toast.LENGTH_SHORT).show();
                    int from= 0;
                    int to= 100000;
                    Intent intent=new Intent(FilterActivity.this,Filtter_data.class);
                    intent.putExtra("city",city);
                    intent.putExtra("from",from);
                    intent.putExtra("to",to);
                    intent.putExtra("id",id);
                    startActivity(intent);
                    finish();
                }
                else{
                String city=spn.getSelectedItem().toString();
                int from= Integer.parseInt(fromm.getText().toString());
                int to= Integer.parseInt(too.getText().toString());
                Intent intent=new Intent(FilterActivity.this,Filtter_data.class);
                intent.putExtra("city",city);
                intent.putExtra("from",from);
                intent.putExtra("to",to);
                intent.putExtra("id",id);
                startActivity(intent);
                finish();}
            }
        });
      spn=findViewById(R.id.spinsss);
        spncontry=findViewById(R.id.spin);
        spncontry.setOnItemSelectedListener(new AdapterView.OnItemSelectedListener() {
            @Override
            public void onItemSelected(AdapterView<?> adapterView, View view, int i, long l) {
                if(spncontry.getSelectedItem().toString().equals("مصر")) {
                    ArrayAdapter<String> adpt_area = new ArrayAdapter<String>(FilterActivity.this,
                            android.R.layout.simple_spinner_dropdown_item, egypt);
                    spn.setAdapter(adpt_area);
                }
                else if(spncontry.getSelectedItem().toString().equals("السعودية")){
                    ArrayAdapter<String> adpt_area = new ArrayAdapter<String>(FilterActivity.this,
                            android.R.layout.simple_spinner_dropdown_item, saudia);
                    spn.setAdapter(adpt_area);
                }
                else if(spncontry.getSelectedItem().toString().equals("الأمارات")){
                    ArrayAdapter<String> adpt_area = new ArrayAdapter<String>(FilterActivity.this,
                            android.R.layout.simple_spinner_dropdown_item, emarat);
                    spn.setAdapter(adpt_area);
                }
                else if(spncontry.getSelectedItem().toString().equals("الكويت")){
                    ArrayAdapter<String> adpt_area = new ArrayAdapter<String>(FilterActivity.this,
                            android.R.layout.simple_spinner_dropdown_item, kuwait);
                    spn.setAdapter(adpt_area);
                }
                else if(spncontry.getSelectedItem().toString().equals("عمان")){
                    ArrayAdapter<String> adpt_area = new ArrayAdapter<String>(FilterActivity.this,
                            android.R.layout.simple_spinner_dropdown_item, aman);
                    spn.setAdapter(adpt_area);
                }
                else if(spncontry.getSelectedItem().toString().equals("قطر")){
                    ArrayAdapter<String> adpt_area = new ArrayAdapter<String>(FilterActivity.this,
                            android.R.layout.simple_spinner_dropdown_item, qatar);
                    spn.setAdapter(adpt_area);
                }
                else if(spncontry.getSelectedItem().toString().equals("البحرين")){
                    ArrayAdapter<String> adpt_area = new ArrayAdapter<String>(FilterActivity.this,
                            android.R.layout.simple_spinner_dropdown_item, bahren);
                    spn.setAdapter(adpt_area);
                }
            }

            @Override
            public void onNothingSelected(AdapterView<?> adapterView) {

            }
        });
      
    }
    String text="الشروط والأحكام\n" +
            "هذه الشروط والأحكام (\"الشروط\"، \"الاتفاقية\") هي اتفاقية بين تطبيق دللي جمالك \"نحن\"، \"نحن\" أو “خاص بنا“ وأنت (\"المستخدم\"، \" أنت\n" +
            "\"أو\" الخاص بك \"). تحدد هذه الاتفاقية الشروط والأحكام العامة لاستخدامك لتطبيقات الهاتف المتنقل دللي جمالك/الموقع الإلكتروني وأي من\n" +
            "منتجاتها أو خدماتها (يشار إليها مجتمعة ب \"تطبيقات الهاتف المتحرك\" أو \"الخدمات\").\n" +
            "الحسابات والعضوية\n" +
            "إذا أنشأت حساب في تطبيق الجوال، فأنت مسؤول عن الحفاظ على أمان حسابك وتتحمل المسؤولية الكاملة عن جميع الأنشطة التي تحدث في\n" +
            "الحساب وأي إجراءات أخرى يتم اتخاذها فيما يتعلق به. قد يؤدي تقديم معلومات اتصال كاذبة من أي نوع إلى إنهاء حسابك. يجب عليك\n" +
            "إخطارنا فورا بأي استخدامات غير مصرح بها لحسابك أو أي مخالفات أخرى للأمن. لن نكون مسؤولين عن أي فعل أو إغفال من قبلك، بما\n" +
            "في ذلك أي أضرار من أي نوع تكبدتها نتيجة لهذه الأعمال أو الامتناع. يجوز لنا تعليق حسابك أو تعطيله أو حذفه (أو أي جزء منه) إذا قررنا\n" +
            "أنك قد انتهكت أي حكم من أحكام هذه الاتفاقية أو أن سلوكك أو محتواك قد يؤدي إلى الإضرار بسمعتنا وحسن نيتنا. إذا حذفنا حسابك للأسباب\n" +
            "السابقة، فلا يجوز لك إعادة التسجيل في خدماتنا. يجوز لنا حظر عنوان بريدك الإلكتروني وعنوان بروتوكول الإنترنت لمنع المزيد من\n" +
            "التسجيل.\n" +
            "النسخ الاحتياطي\n" +
            "نحن لسنا مسؤولين عن المحتوى الموجود في تطبيقنا. في أي حال من الأحوال نحن لن نكون مسؤولين عن أي فقدان أي محتوى. تقع على\n" +
            "عاتقك مسؤولية الحفاظ على النسخ الاحتياطي المناسب للمحتوى الخاص بك. على الرغم مما تقدم، في بعض الأحيان وفي بعض الحالات،\n" +
            "مع أي التزام مطلقا، قد نتمكن من استعادة بعض أو كل البيانات التي تم حذفها. نحن لا نضمن أن البيانات التي تحتاج إليها ستكون متاحة.\n" +
            "روابط إلى تطبيقات الجوال/مواقع اخرى\n" +
            "على الرغم من أن هذا التطبيق/الموقع قد يكون مرتبطا مع تطبيقات/مواقع إلكترونية اخرى، نحن لسنا، بشكل مباشر أو غير مباشر، مما يعني\n" +
            "أي موافقة أو جمعية أو رعاية أو تأييد أو الانتماء مع أي تطبيقات الهاتف المتحرك المرتبطة، ما لم ينص على وجه التحديد هنا. نحن لسنا\n" +
            "مسؤولين عن فحص أو تقييم، ونحن لا نضمن العروض، أي شركات أو أفراد أو محتوى تطبيقاتهم/مواقعهم الإلكترونية. نحن لا نتحمل أي\n" +
            "مسؤولية أو مسؤولية عن الإجراءات والمنتجات والخدمات والمحتوى من أي أطراف ثالثة أخرى. يجب عليك مراجعة بعناية البيانات القانونية\n" +
            "وغيرها من شروط استخدام أي تطبيقات الهاتف المتحرك التي يمكنك الوصول إليها من خلال وصلة من هذا التطبيق المحمول. إن ربطك\n" +
            "بأي تطبيقات جوال أخرى خارج الموقع يكون على مسؤوليتك الخاصة.\n" +
            "إعلانات\n" +
            "أثناء استخدام تطبيق الهاتف المتحرك، يمكنك الدخول في مراسلات مع المعلنين أو الرعاة الذين يعرضون بضائعهم أو خدماتهم أو يشاركون\n" +
            "فيها من خلال تطبيق الجوال/الموقع الإلكتروني. أي نشاط من هذا القبيل وأي شروط أو ضمانات أو تعهدات مرتبطة بهذا النشاط، هو فقط\n" +
            "بينك وبين الطرف الثالث الساري. لن نتحمل أي مسؤولية أو التزام أو مسؤولية عن أي مراسلات أو عمليات شراء أو ترقية بينك وبين أي\n" +
            "طرف ثالث.\n" +
            "الاستخدامات المحظورة\n" +
            "بالإضافة إلى البنود الأخرى المنصوص عليها في الاتفاقية، يحظر عليك استخدام تطبيق الجوال/الموقع الإلكتروني أو محتواه: (أ) لأي غرض\n" +
            "غير قانوني؛ (ب) التماس الآخرين للقيام بأية أعمال غير مشروعة أو المشاركة فيها؛ (ج) انتهاك أي أنظمة أو قواعد أو قوانين أو قوانين\n" +
            "محلية أو اتحادية أو إقليمية أو حكومية؛ (د) انتهاك حقوق الملكية الفكرية الخاصة بنا أو حقوق الملكية الفكرية للآخرين أو انتهاكها؛ (ه)\n" +
            "التحرش أو الإيذاء أو الإهانة أو الإيذاء أو التشهير أو الخداع أو التخويف أو التمييز على أساس الجنس أو التوجه الجنسي أو الدين أو العرق\n" +
            "أو العرق أو السن أو الأصل القومي أو الإعاقة؛ (و) تقديم معلومات خاطئة أو مضللة؛ (ز) تحميل أو نقل الفيروسات أو أي نوع آخر من\n" +
            "الشيفرات الخبيثة التي سوف تستخدم أو يمكن استخدامها بأي شكل من الأشكال التي سوف تؤثر على وظيفة أو تشغيل الخدمة أو أي تطبيقات\n" +
            "الهاتف المتحرك ذات الصلة، تطبيقات الجوال الأخرى، أو الإنترنت؛ (ح) جمع أو تتبع المعلومات الشخصية للآخرين؛ ( 1) إلى البريد\n" +
            "للتدخل أو التحايل على السمات الأمنية للخدمة أو أي تطبيقات (k) المزعج، الزحف، أو كشط. (ي) لأي غرض فاحش أو غير أخلاقي؛ أو\n" +
            "جوال ذات صلة أو تطبيقات جوال أخرى أو الإنترنت. نحن نحتفظ بالحق في إنهاء استخدامك للخدمة أو أي تطبيقات جوال ذات صلة لانتهاك\n" +
            "أي من الاستخدامات المحظورة.\n" +
            "الضمان\n" +
            "إنك توافق على أن استخدامك لتطبيقات الجوال/المواقع الإلكترونية أو خدماتنا هو فقط على مسؤوليتك الخاصة. أنت توافق على أن هذه الخدمة\n" +
            "تقدم على أساس \"كما هي\" و \"كما هو متاح\". نحن نخلي صراحة عن جميع الضمانات من أي نوع، سواء كانت صريحة أو ضمنية، بما في\n" +
            "ذلك على سبيل المثال لا الحصر الضمانات الضمنية للرواج والملاءمة لغرض معين وعدم الانتهاك. نحن لا نقدم أي ضمان بأن الخدمات\n" +
            "سوف تلبي الاحتياجات الخاصة بك، أو أن الخدمة سوف تكون دون انقطاع، في الوقت المناسب، آمنة، أو خالية من الأخطاء. كما لا نقدم أي\n" +
            "ضمان للنتائج التي يمكن الحصول عليها من استخدام الخدمة أو دقة أو موثوقية أي معلومات تم الحصول عليها من خلال الخدمة أو أن العيوب\n" +
            "في الخدمة سيتم تصحيحها. أنت تدرك وتوافق على أن أي مواد و/ أو بيانات يتم تحميلها أو الحصول عليها بطريقة أخرى من خلال استخدام\n" +
            "الخدمة تتم وفقا لتقديرك الخاص والمخاطر وأنك ستكون المسؤول الوحيد عن أي ضرر لنظام الكمبيوتر الخاص بك أو فقدان البيانات التي\n" +
            "تنتج عن تحميل هذه المواد و / أو البيانات. نحن لا نقدم أي ضمان بشأن أي بضائع أو خدمات تم شراؤها أو الحصول عليها من خلال الخدمة\n" +
            "أو أي معاملات دخلت من خلال الخدمة. أي نصيحة أو معلومات، سواء كانت شفهية أو مكتوبة، تم الحصول عليها من قبلك منا أو من خلال\n" +
            "الخدمة، يجب أن تخلق أي ضمان غير منصوص عليه صراحة هنا.\n" +
            "التعويض\n" +
            "أنت توافق على تعويض أداره التطبيق عن وضد أي التزامات أو خسائر أو أضرار أو تكاليف، بما في ذلك أتعاب المحاماة المعقولة التي\n" +
            "تكبدتها فيما يتعلق أو الناشئة عن أي مزاعم أو مطالبات أو إجراءات أو نزاعات أو مطالبات من جهة خارجية ضد أي منها نتيجة لمحتواك\n" +
            "أو متعلقة بها أو استخدامك لتطبيقات الجوال أو خدماتك أو أي سوء تصرف متعمد من جانبك.\n" +
            "انتقال الاعمال\n" +
            "إذا تم الاستحواذ على تطبيقات الجوال/المواقع الإلكترونية أو خدماتنا من قبل جهة ثالثة (شركة أخرى مثلا) فإن معلومات المشتركين تعتبر\n" +
            "من الأصول التي تنتقل إلى الجهة الثالثة. يقر العميل بأن هذا شيء وارد وأن الطرف الثالث بإمكانه أن يستخدم معلومات المشترك كما هو\n" +
            "مذكور في هذه الاتفاقية.\n" +
            "قابلية\n" +
            "يجوز ممارسة جميع الحقوق والقيود الواردة في هذه الاتفاقية، وتكون قابلة للتطبيق وملزمة فقط إلى الحد الذي لا تنتهك فيه أي قوانين سارية،\n" +
            "ويقصد بها أن تقتصر على الحد الضروري بحيث لا يتم تقديم هذه الاتفاقية غير قانوني، غير صالح أو غير قابل للتنفيذ. إذا كان أي حكم أو\n" +
            "جزء من أي حكم من أحكام هذه الاتفاقية يعتبر غير قانوني أو غير صالح أو غير قابل للتنفيذ من قبل محكمة ذات اختصاص قضائي، فإن نية\n" +
            "الطرفين أن تكون الأحكام أو أجزاء منها المتبقية تشكل موافقتها على وتظل كل هذه الأحكام المتبقية أو أجزاء منها سارية المفعول والنافذة.\n" +
            "حل النزاع\n" +
            "يخضع تشكيل وتفسير وأداء هذه الاتفاقية وأي نزاعات تنشأ عنها للقوانين الموضوعية والإجرائية في الرياض بالمملكة العربية السعودية\n" +
            "بغض النظر عن قواعدها المتعلقة بالنزاعات أو اختيار القانون، وإلى الحد الذي ينطبق، وقوانين المملكة العربية السعودية. ويكون الاختصاص\n" +
            "والمكان الحصريان للإجراءات المتعلقة بموضوع هذا القانون هي محاكم المملكة العربية السعودية، وتنتقل بموجبها إلى الاختصاص الشخصي\n" +
            "لهذه المحاكم. أنت بموجب هذا التنازل عن أي حق في محاكمة هيئة محلفين في أي إجراء ينشأ عن أو يتعلق بهذا الاتفاق.\n" +
            "تعيين\n" +
            "لا يجوز لك تعيين أو إعادة بيع أو ترخيص فرعي أو نقل أو تفويض أي من حقوقك أو التزاماتك بموجب هذه الاتفاقية، كليا أو جزئيا، دون\n" +
            "الحصول على موافقة كتابية مسبقة، ويكون ذلك وفقا لتقديرنا الخاص وبدون التزام. فإن أي إحالة أو نقل تكون باطلة ولاغية. نحن أحرار في\n" +
            "تعيين أي من حقوقها أو التزاماتها بموجب هذه الاتفاقية، كليا أو جزئيا، إلى أي طرف ثالث كجزء من بيع جميع أو جميع أصولها أو مخزونها\n" +
            "أو كجزء من عملية الدمج.\n" +
            "التغييرات والتعديلات\n" +
            "نحن نحتفظ بالحق في تعديل هذه الاتفاقية أو سياساتها المتعلقة بتطبيقات الجوال/المواقع الإلكترونية أو خدماتها في أي وقت، ويسري ذلك عند\n" +
            "نشر نسخة محدثة من هذه الاتفاقية في تطبيق الجوال. عندما نفعل نحن سوف ننشر إخطار في تطبيقات الهاتف المتحرك لدينا. الاستمرار في\n" +
            "استخدام تطبيقات الهاتف المتحرك بعد أي تغييرات من هذا القبيل يشكل موافقتك على هذه التغييرات.\n" +
            "قبول هذه البنود\n" +
            "أنت تقر بأنك قرأت هذه الاتفاقية وتوافق على جميع بنود وشروطها. باستخدام تطبيقات الهاتف المتحرك/الموقع الإلكتروني أو خدماتها فإنك\n" +
            "توافق على الالتزام بهذه الاتفاقية. إذا كنت لا توافق على الالتزام ببنود هذه الاتفاقية، فأنت غير مخول لاستخدام أو الدخول إلى تطبيق الجوال\n" +
            "وخدماته.\n" +
            "الاتصال بنا\n" +
            "إذا كانت لديك أية أسئلة حول هذه الاتفاقية، يرجى الاتصال بنا.";
}
