package com.yarolegovich.dalilegamalek.sample.Activity;

import android.app.AlertDialog;
import android.app.Dialog;
import android.app.ProgressDialog;
import android.content.Context;
import android.content.Intent;
import android.content.SharedPreferences;
import android.view.View;
import android.widget.Button;
import android.widget.TextView;
import android.widget.Toast;

import com.yarolegovich.dalilegamalek.sample.R;
import com.yarolegovich.dalilegamalek.sample.SampleActivity;
import com.yarolegovich.dalilegamalek.sample.model.Apiclient_home;
import com.yarolegovich.dalilegamalek.sample.model.apiinterface_home;
import com.yarolegovich.dalilegamalek.sample.model.contact_home;

import java.util.List;

import retrofit2.Call;
import retrofit2.Callback;
import retrofit2.Response;

public class login_ {
    Dialog dialog;
    String text="الشروط والأحكام\n" +
            "هذه الشروط والأحكام (\"الشروط\"، \"الاتفاقية\") هي اتفاقية بين تطبيق دللي جمالك \"نحن\"، \"نحن\" أو “خاص بنا“ وأنت (\"المستخدم\"، \" أنت\n" +
            "\"أو\" الخاص بك \"). تحدد هذه الاتفاقية الشروط والأحكام العامة لاستخدامك لتطبيقات الهاتف المتنقل دللي جمالك/الموقع الإلكتروني وأي من\n" +
            "منتجاتها أو خدماتها (يشار إليها مجتمعة ب \"تطبيقات الهاتف المتحرك\" أو \"الخدمات\").\n" +
            "الحسابات والعضوية\n" +
            "إذا أنشأت حساب في تطبيق الجوال، فأنت مسؤول عن الحفاظ على أمان حسابك وتتحمل المسؤولية الكاملة عن جميع الأنشطة التي تحدث في\n" +
            "الحساب وأي إجراءات أخرى يتم اتخاذها فيما يتعلق به. قد يؤدي تقديم معلومات اتصال كاذبة من أي نوع إلى إنهاء حسابك. يجب عليك\n" +
            "إخطارنا فورا بأي استخدامات غير مصرح بها لحسابك أو أي مخالفات أخرى للأمن. لن نكون مسؤولين عن أي فعل أو إغفال من قبلك، بما\n" +
            "في ذلك أي أضرار من أي نوع تكبدتها نتيجة لهذه الأعمال أو الامتناع. يجوز لنا تعليق حسابك أو تعطيله أو حذفه (أو أي جزء منه) إذا قررنا\n" +
            "أنك قد انتهكت أي حكم من أحكام هذه الاتفاقية أو أن سلوكك أو محتواك قد يؤدي إلى الإضرار بسمعتنا وحسن نيتنا. إذا حذفنا حسابك للأسباب\n" +
            "السابقة، فلا يجوز لك إعادة التسجيل في خدماتنا. يجوز لنا حظر عنوان بريدك الإلكتروني وعنوان بروتوكول الإنترنت لمنع المزيد من\n" +
            "التسجيل.\n" +
            "النسخ الاحتياطي\n" +
            "نحن لسنا مسؤولين عن المحتوى الموجود في تطبيقنا. في أي حال من الأحوال نحن لن نكون مسؤولين عن أي فقدان أي محتوى. تقع على\n" +
            "عاتقك مسؤولية الحفاظ على النسخ الاحتياطي المناسب للمحتوى الخاص بك. على الرغم مما تقدم، في بعض الأحيان وفي بعض الحالات،\n" +
            "مع أي التزام مطلقا، قد نتمكن من استعادة بعض أو كل البيانات التي تم حذفها. نحن لا نضمن أن البيانات التي تحتاج إليها ستكون متاحة.\n" +
            "روابط إلى تطبيقات الجوال/مواقع اخرى\n" +
            "على الرغم من أن هذا التطبيق/الموقع قد يكون مرتبطا مع تطبيقات/مواقع إلكترونية اخرى، نحن لسنا، بشكل مباشر أو غير مباشر، مما يعني\n" +
            "أي موافقة أو جمعية أو رعاية أو تأييد أو الانتماء مع أي تطبيقات الهاتف المتحرك المرتبطة، ما لم ينص على وجه التحديد هنا. نحن لسنا\n" +
            "مسؤولين عن فحص أو تقييم، ونحن لا نضمن العروض، أي شركات أو أفراد أو محتوى تطبيقاتهم/مواقعهم الإلكترونية. نحن لا نتحمل أي\n" +
            "مسؤولية أو مسؤولية عن الإجراءات والمنتجات والخدمات والمحتوى من أي أطراف ثالثة أخرى. يجب عليك مراجعة بعناية البيانات القانونية\n" +
            "وغيرها من شروط استخدام أي تطبيقات الهاتف المتحرك التي يمكنك الوصول إليها من خلال وصلة من هذا التطبيق المحمول. إن ربطك\n" +
            "بأي تطبيقات جوال أخرى خارج الموقع يكون على مسؤوليتك الخاصة.\n" +
            "إعلانات\n" +
            "أثناء استخدام تطبيق الهاتف المتحرك، يمكنك الدخول في مراسلات مع المعلنين أو الرعاة الذين يعرضون بضائعهم أو خدماتهم أو يشاركون\n" +
            "فيها من خلال تطبيق الجوال/الموقع الإلكتروني. أي نشاط من هذا القبيل وأي شروط أو ضمانات أو تعهدات مرتبطة بهذا النشاط، هو فقط\n" +
            "بينك وبين الطرف الثالث الساري. لن نتحمل أي مسؤولية أو التزام أو مسؤولية عن أي مراسلات أو عمليات شراء أو ترقية بينك وبين أي\n" +
            "طرف ثالث.\n" +
            "الاستخدامات المحظورة\n" +
            "بالإضافة إلى البنود الأخرى المنصوص عليها في الاتفاقية، يحظر عليك استخدام تطبيق الجوال/الموقع الإلكتروني أو محتواه: (أ) لأي غرض\n" +
            "غير قانوني؛ (ب) التماس الآخرين للقيام بأية أعمال غير مشروعة أو المشاركة فيها؛ (ج) انتهاك أي أنظمة أو قواعد أو قوانين أو قوانين\n" +
            "محلية أو اتحادية أو إقليمية أو حكومية؛ (د) انتهاك حقوق الملكية الفكرية الخاصة بنا أو حقوق الملكية الفكرية للآخرين أو انتهاكها؛ (ه)\n" +
            "التحرش أو الإيذاء أو الإهانة أو الإيذاء أو التشهير أو الخداع أو التخويف أو التمييز على أساس الجنس أو التوجه الجنسي أو الدين أو العرق\n" +
            "أو العرق أو السن أو الأصل القومي أو الإعاقة؛ (و) تقديم معلومات خاطئة أو مضللة؛ (ز) تحميل أو نقل الفيروسات أو أي نوع آخر من\n" +
            "الشيفرات الخبيثة التي سوف تستخدم أو يمكن استخدامها بأي شكل من الأشكال التي سوف تؤثر على وظيفة أو تشغيل الخدمة أو أي تطبيقات\n" +
            "الهاتف المتحرك ذات الصلة، تطبيقات الجوال الأخرى، أو الإنترنت؛ (ح) جمع أو تتبع المعلومات الشخصية للآخرين؛ ( 1) إلى البريد\n" +
            "للتدخل أو التحايل على السمات الأمنية للخدمة أو أي تطبيقات (k) المزعج، الزحف، أو كشط. (ي) لأي غرض فاحش أو غير أخلاقي؛ أو\n" +
            "جوال ذات صلة أو تطبيقات جوال أخرى أو الإنترنت. نحن نحتفظ بالحق في إنهاء استخدامك للخدمة أو أي تطبيقات جوال ذات صلة لانتهاك\n" +
            "أي من الاستخدامات المحظورة.\n" +
            "الضمان\n" +
            "إنك توافق على أن استخدامك لتطبيقات الجوال/المواقع الإلكترونية أو خدماتنا هو فقط على مسؤوليتك الخاصة. أنت توافق على أن هذه الخدمة\n" +
            "تقدم على أساس \"كما هي\" و \"كما هو متاح\". نحن نخلي صراحة عن جميع الضمانات من أي نوع، سواء كانت صريحة أو ضمنية، بما في\n" +
            "ذلك على سبيل المثال لا الحصر الضمانات الضمنية للرواج والملاءمة لغرض معين وعدم الانتهاك. نحن لا نقدم أي ضمان بأن الخدمات\n" +
            "سوف تلبي الاحتياجات الخاصة بك، أو أن الخدمة سوف تكون دون انقطاع، في الوقت المناسب، آمنة، أو خالية من الأخطاء. كما لا نقدم أي\n" +
            "ضمان للنتائج التي يمكن الحصول عليها من استخدام الخدمة أو دقة أو موثوقية أي معلومات تم الحصول عليها من خلال الخدمة أو أن العيوب\n" +
            "في الخدمة سيتم تصحيحها. أنت تدرك وتوافق على أن أي مواد و/ أو بيانات يتم تحميلها أو الحصول عليها بطريقة أخرى من خلال استخدام\n" +
            "الخدمة تتم وفقا لتقديرك الخاص والمخاطر وأنك ستكون المسؤول الوحيد عن أي ضرر لنظام الكمبيوتر الخاص بك أو فقدان البيانات التي\n" +
            "تنتج عن تحميل هذه المواد و / أو البيانات. نحن لا نقدم أي ضمان بشأن أي بضائع أو خدمات تم شراؤها أو الحصول عليها من خلال الخدمة\n" +
            "أو أي معاملات دخلت من خلال الخدمة. أي نصيحة أو معلومات، سواء كانت شفهية أو مكتوبة، تم الحصول عليها من قبلك منا أو من خلال\n" +
            "الخدمة، يجب أن تخلق أي ضمان غير منصوص عليه صراحة هنا.\n" +
            "التعويض\n" +
            "أنت توافق على تعويض أداره التطبيق عن وضد أي التزامات أو خسائر أو أضرار أو تكاليف، بما في ذلك أتعاب المحاماة المعقولة التي\n" +
            "تكبدتها فيما يتعلق أو الناشئة عن أي مزاعم أو مطالبات أو إجراءات أو نزاعات أو مطالبات من جهة خارجية ضد أي منها نتيجة لمحتواك\n" +
            "أو متعلقة بها أو استخدامك لتطبيقات الجوال أو خدماتك أو أي سوء تصرف متعمد من جانبك.\n" +
            "انتقال الاعمال\n" +
            "إذا تم الاستحواذ على تطبيقات الجوال/المواقع الإلكترونية أو خدماتنا من قبل جهة ثالثة (شركة أخرى مثلا) فإن معلومات المشتركين تعتبر\n" +
            "من الأصول التي تنتقل إلى الجهة الثالثة. يقر العميل بأن هذا شيء وارد وأن الطرف الثالث بإمكانه أن يستخدم معلومات المشترك كما هو\n" +
            "مذكور في هذه الاتفاقية.\n" +
            "قابلية\n" +
            "يجوز ممارسة جميع الحقوق والقيود الواردة في هذه الاتفاقية، وتكون قابلة للتطبيق وملزمة فقط إلى الحد الذي لا تنتهك فيه أي قوانين سارية،\n" +
            "ويقصد بها أن تقتصر على الحد الضروري بحيث لا يتم تقديم هذه الاتفاقية غير قانوني، غير صالح أو غير قابل للتنفيذ. إذا كان أي حكم أو\n" +
            "جزء من أي حكم من أحكام هذه الاتفاقية يعتبر غير قانوني أو غير صالح أو غير قابل للتنفيذ من قبل محكمة ذات اختصاص قضائي، فإن نية\n" +
            "الطرفين أن تكون الأحكام أو أجزاء منها المتبقية تشكل موافقتها على وتظل كل هذه الأحكام المتبقية أو أجزاء منها سارية المفعول والنافذة.\n" +
            "حل النزاع\n" +
            "يخضع تشكيل وتفسير وأداء هذه الاتفاقية وأي نزاعات تنشأ عنها للقوانين الموضوعية والإجرائية في الرياض بالمملكة العربية السعودية\n" +
            "بغض النظر عن قواعدها المتعلقة بالنزاعات أو اختيار القانون، وإلى الحد الذي ينطبق، وقوانين المملكة العربية السعودية. ويكون الاختصاص\n" +
            "والمكان الحصريان للإجراءات المتعلقة بموضوع هذا القانون هي محاكم المملكة العربية السعودية، وتنتقل بموجبها إلى الاختصاص الشخصي\n" +
            "لهذه المحاكم. أنت بموجب هذا التنازل عن أي حق في محاكمة هيئة محلفين في أي إجراء ينشأ عن أو يتعلق بهذا الاتفاق.\n" +
            "تعيين\n" +
            "لا يجوز لك تعيين أو إعادة بيع أو ترخيص فرعي أو نقل أو تفويض أي من حقوقك أو التزاماتك بموجب هذه الاتفاقية، كليا أو جزئيا، دون\n" +
            "الحصول على موافقة كتابية مسبقة، ويكون ذلك وفقا لتقديرنا الخاص وبدون التزام. فإن أي إحالة أو نقل تكون باطلة ولاغية. نحن أحرار في\n" +
            "تعيين أي من حقوقها أو التزاماتها بموجب هذه الاتفاقية، كليا أو جزئيا، إلى أي طرف ثالث كجزء من بيع جميع أو جميع أصولها أو مخزونها\n" +
            "أو كجزء من عملية الدمج.\n" +
            "التغييرات والتعديلات\n" +
            "نحن نحتفظ بالحق في تعديل هذه الاتفاقية أو سياساتها المتعلقة بتطبيقات الجوال/المواقع الإلكترونية أو خدماتها في أي وقت، ويسري ذلك عند\n" +
            "نشر نسخة محدثة من هذه الاتفاقية في تطبيق الجوال. عندما نفعل نحن سوف ننشر إخطار في تطبيقات الهاتف المتحرك لدينا. الاستمرار في\n" +
            "استخدام تطبيقات الهاتف المتحرك بعد أي تغييرات من هذا القبيل يشكل موافقتك على هذه التغييرات.\n" +
            "قبول هذه البنود\n" +
            "أنت تقر بأنك قرأت هذه الاتفاقية وتوافق على جميع بنود وشروطها. باستخدام تطبيقات الهاتف المتحرك/الموقع الإلكتروني أو خدماتها فإنك\n" +
            "توافق على الالتزام بهذه الاتفاقية. إذا كنت لا توافق على الالتزام ببنود هذه الاتفاقية، فأنت غير مخول لاستخدام أو الدخول إلى تطبيق الجوال\n" +
            "وخدماته.\n" +
            "الاتصال بنا\n" +
            "إذا كانت لديك أية أسئلة حول هذه الاتفاقية، يرجى الاتصال بنا.";
    private List<contact_home> contactList;
    private apiinterface_home apiinterface;
    private SharedPreferences sharedpref;
    private SharedPreferences.Editor edt;
    ProgressDialog progressDialog;
    public void fetchInfo(final Context context, String phone,String password){
        sharedpref = context.getSharedPreferences("ManoAd", Context.MODE_PRIVATE);
        edt = sharedpref.edit();

        progressDialog = ProgressDialog.show(context,"جاري تسجيل الدخول","Please wait...",false,false);
        progressDialog.show();
        apiinterface= Apiclient_home.getapiClient().create(apiinterface_home.class);
        Call<List<contact_home>> call= apiinterface.getcontacts_login(phone,password);
        call.enqueue(new Callback<List<contact_home>>() {
            @Override
            public void onResponse(Call<List<contact_home>> call, Response<List<contact_home>> response) {
                contactList = response.body();
                progressDialog.dismiss();
              try{
                  login(context);
             }
                catch (Exception e){

                }
            }

            @Override
            public void onFailure(Call<List<contact_home>> call, Throwable t) {
                Toast.makeText(context,t.toString(), Toast.LENGTH_LONG).show();
            }
        });
    }
public void dialgsupport(final Context context){
    dialog=new Dialog(context);
    dialog.setContentView(R.layout.dialog_support);
    dialog.setTitle("دللي جمالك");
    dialog.show();
    TextView textView=dialog.findViewById(R.id.dialogtext);
    textView.setText(text);
    Button accept=dialog.findViewById(R.id.accept);
    accept.setOnClickListener(new View.OnClickListener() {
        @Override
        public void onClick(View view) {

        }
    });
}
public void login( Context context){
    AlertDialog.Builder dlgAlert  = new AlertDialog.Builder(context);
    dlgAlert.setMessage("تم تسجيل الدخول بنجاح");
    dlgAlert.setTitle("دللي جمالك");
    dlgAlert.setPositiveButton("OK", null);
    dlgAlert.setCancelable(true);
    dlgAlert.create().show();
    edt.putInt("id",contactList.get(0).getId());
    edt.putString("name",contactList.get(0).getName());
    edt.putString("phone",contactList.get(0).getPhone());
    edt.putString("address",contactList.get(0).getAddress());
    edt.putString("password",contactList.get(0).getPassword());
    edt.putInt("points",contactList.get(0).getPoints());
    edt.putString("email",contactList.get(0).getEmail());
    edt.putString("image",contactList.get(0).getImage());
    edt.putString("age", String.valueOf(contactList.get(0).getDate()));
    edt.putString("remember","yes");
    edt.apply();
    context.startActivity(new Intent(context, SampleActivity.class));
}
}
